Tekla Open API Reference for Tekla Structures 2025
RebarEndDetailModifier Properties
The RebarEndDetailModifier type exposes the following members.
Properties
Name | Description
BarsAffected
 Gets or sets the reinforcing bars affected.
 (Inherited from BaseRebarModifier.)
Curve
 Gets or sets the geometric Contour of the rebar modifier.
 (Inherited from BaseRebarModifier.)
EndType
 Gets or sets the end type.
Father
 Gets or sets the RebarSet to which the modifier belongs. Only reinforcing bars generated by this RebarSet can be modified by this rebar modifier.
 (Inherited from BaseRebarModifier.)
FirstAffectedBar
 Gets or sets the first affected bar. If set to zero, the first affected bar will be chosen automatically.
 (Inherited from BaseRebarModifier.)
FollowEdges
 Gets or sets a flag that indicates whether the modifier should attempt to follow the leg face edges located between its end points.
 (Inherited from BaseRebarModifier.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
RebarCranking
 Gets or sets the rebar cranking.
RebarHook
 Gets or sets the reinforcing bar hook data.
RebarLengthAdjustment
 Gets or sets the reinforcing bar length adjustment data.
RebarThreading
 Gets or sets the reinforcing bar threading data.
Top
See Also
Reference
RebarEndDetailModifier Class
Tekla.Structures.Model Namespace